MikroElektronika/core_packages/ARM/gcc_clang/def/gigadevice/GD32E507RET6/mcu.h
/* main flash and SRAM memory map */
#define FLASH_BASE            ((uint32_t)0x08000000U)       /*!< main FLASH base address */
#define SRAM_BASE             ((uint32_t)0x20000000U)       /*!< SRAM base address */

/* peripheral memory map */
#define APB1_BUS_BASE         ((uint32_t)0x40000000U)       /*!< apb1 base address */
#define APB2_BUS_BASE         ((uint32_t)0x40010000U)       /*!< apb2 base address */
#define AHB1_BUS_BASE         ((uint32_t)0x40018000U)       /*!< ahb1 base address */
#define AHB3_BUS_BASE         ((uint32_t)0x60000000U)       /*!< ahb3 base address */

/* advanced peripheral bus 1 memory map */
#define TIMER_BASE            (APB1_BUS_BASE + 0x00000000U) /*!< TIMER base address */
#define RTC_BASE              (APB1_BUS_BASE + 0x00002800U) /*!< RTC base address */
#define WWDGT_BASE            (APB1_BUS_BASE + 0x00002C00U) /*!< WWDGT base address */
#define FWDGT_BASE            (APB1_BUS_BASE + 0x00003000U) /*!< FWDGT base address */
#define I2S_ADD_BASE          (APB1_BUS_BASE + 0x00003400U) /*!< I2S_add base address */
#define SPI_BASE              (APB1_BUS_BASE + 0x00003800U) /*!< SPI base address */
#define USART_BASE            (APB1_BUS_BASE + 0x00004400U) /*!< USART base address */
#define I2C_BASE              (APB1_BUS_BASE + 0x00005400U) /*!< I2C base address */
#define USBD_BASE             (APB1_BUS_BASE + 0x00005C00U) /*!< USBD base address */
#define USBD_RAM_BASE         (APB1_BUS_BASE + 0x00006000U) /*!< USBD RAM base address */
#define CAN_BASE              (APB1_BUS_BASE + 0x00006400U) /*!< CAN base address */
#define BKP_BASE              (APB1_BUS_BASE + 0x00006C00U) /*!< BKP base address */
#define PMU_BASE              (APB1_BUS_BASE + 0x00007000U) /*!< PMU base address */
#define DAC_BASE              (APB1_BUS_BASE + 0x00007400U) /*!< DAC base address */
#define CTC_BASE              (APB1_BUS_BASE + 0x0000C800U) /*!< CTC base address */

/* advanced peripheral bus 2 memory map */
#define AFIO_BASE             (APB2_BUS_BASE + 0x00000000U) /*!< AFIO base address */
#define EXTI_BASE             (APB2_BUS_BASE + 0x00000400U) /*!< EXTI base address */
#define GPIO_BASE             (APB2_BUS_BASE + 0x00000800U) /*!< GPIO base address */
#define ADC_BASE              (APB2_BUS_BASE + 0x00002400U) /*!< ADC base address */
#define SHRTIMER_BASE         (APB2_BUS_BASE + 0x00007400U) /*!< SHRTIMER base address */
#define CMP_BASE              (APB2_BUS_BASE + 0x00007C00U) /*!< CMP base address */

/* advanced high performance bus 1 memory map */
#define SDIO_BASE             (AHB1_BUS_BASE + 0x00000000U) /*!< SDIO base address */
#define DMA_BASE              (AHB1_BUS_BASE + 0x00008000U) /*!< DMA base address */
#define RCU_BASE              (AHB1_BUS_BASE + 0x00009000U) /*!< RCU base address */
#define FMC_BASE              (AHB1_BUS_BASE + 0x0000A000U) /*!< FMC base address */
#define CRC_BASE              (AHB1_BUS_BASE + 0x0000B000U) /*!< CRC base address */
#define ENET_BASE             (AHB1_BUS_BASE + 0x00010000U) /*!< ENET base address */
#define TMU_BASE              (AHB1_BUS_BASE + 0x00068000U) /*!< TMU base address */
#define USBHS_BASE            (AHB1_BUS_BASE + 0x0FFE8000U) /*!< USBHS base address */

/* advanced high performance bus 3 memory map */
#define EXMC_BASE             (AHB3_BUS_BASE + 0x40000000U) /*!< EXMC base address */

/* option byte and debug memory map */
#define OB_BASE               ((uint32_t)0x1FFFF800U)       /*!< OB base address */
#define DBG_BASE              ((uint32_t)0xE0044000U)       /*!< DBG base address */
#define SQPI_BASE             ((uint32_t)0xA0001000U)       /*!< SQPI base address */
// #include "gd32e50x_libopt.h"  // Note: Changed for MikroE implementation.

#ifdef __cplusplus
}
#endif

#endif /* GD32E50X_H */
